ATsupportum/src/Catalogs/ВыделенныеIP_ат/ВыделенныеIP_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВыделенныеIP_ат</name>
  <owners>Catalog.СетевыеИнтерфейсы_ат</owners>
  <attributes>
    <name>ПредставлениеIP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>mask</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальнаяСеть</name>
    <type>
      <types>CatalogRef.ВиртуальныеСети_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Белый</name>
    <comment>Это адрес, по которому можно постучаться на сервер из внешней сети (из интернета), Контроль правильности не ведется!</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Чужой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Catalogs/Серверы_ат/Серверы_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Серверы_ат</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Лезвие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МатеринскаяПлата</name>
    <type>
      <types>CatalogRef.МатеринскиеПлаты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>HyperThreading</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Виртуализация</name>
    <type>
      <types>CatalogRef.ВидыВиртуализацииСерверов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Hostname</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шлюз</name>
    <type>
      <types>CatalogRef.ВыделенныеIP_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентВладелец</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Чужой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойIP</name>
    <type>
      <types>CatalogRef.ВыделенныеIP_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляНас</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CPU_ат</name>
    <attributes>
      <name>Процессор</name>
      <type>
        <types>CatalogRef.CPU_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RAM</name>
    <attributes>
      <name>МодулиПамяти_ат</name>
      <type>
        <types>CatalogRef.МодулиПамяти_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>HDD_ат</name>
    <attributes>
      <name>HDD_ат</name>
      <type>
        <types>CatalogRef.HDD_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Raid</name>
      <type>
        <types>EnumRef.ТипыRAID_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СХД_ат</name>
    <attributes>
      <name>СХД_ат</name>
      <type>
        <types>CatalogRef.СХД_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>IPv4</name>
    <attributes>
      <name>IP</name>
      <type>
        <types>CatalogRef.ВыделенныеIP_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DNS_servers</name>
    <attributes>
      <name>DNS</name>
      <type>
        <types>CatalogRef.ВыделенныеIP_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Wins_servers</name>
    <attributes>
      <name>WINS</name>
      <type>
        <types>CatalogRef.ВыделенныеIP_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DNS_суффиксы</name>
    <attributes>
      <name>DNS_суффикс</name>
      <type>
        <types>CatalogRef.DNS_суффиксы_ат</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Interfaces_</name>
    <attributes>
      <name>Interface</name>
      <type>
        <types>CatalogRef.СетевыеИнтерфейсы_ат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/Catalogs/ВыделенныеIP_ат/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления тогда 
		
		Если НЕ Ссылка.ПометкаУдаления тогда
			
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			Если не Ссылка.Пустая() тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Серверы_ат.Ссылка
				|ИЗ
				|	Справочник.Серверы_ат КАК Серверы_ат
				|ГДЕ
				|	Серверы_ат.ОсновнойIP = &ОсновнойIP";
				
				Запрос.УстановитьПараметр("ОсновнойIP", Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если РезультатЗапроса.Пустой() тогда
				Иначе
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Установка пометки удаления невозможна, так как данный IP используется в сервере: " 
						+ ВыборкаДетальныеЗаписи.Ссылка +Символы.ПС + "Для установки пометки удаления необходимо очистить поле ОсновнойIP на сервере";
						Сообщение.Сообщить();
					КонецЦикла;
					Отказ = Истина;
					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		IP = РаботаССерверамиСлужебный_ат.ПреобразоватьIPВЧисло(ПредставлениеIP);
		
	КонецЕсли;
	
КонецПроцедуры
